Repository: LeQuangThang205/2025_LTTBDD_N05_LE_QUANG_THANG
Catalog: lib/l10n/app_*.arb
Languages: vi

# appTitle
source: BMI Calculator App
vi: Ứng dụng Tính BMI

source: Home
vi: Trang chủ

source: History
vi: Lịch sử BMI

source: About
vi: Giới thiệu

source: Blog
vi: Bài viết

source: Login
vi: Đăng nhập

source: Register
vi: Đăng ký

source: Change Language
vi: Chuyển ngôn ngữ

# welcomeMessage
source: Welcome to the BMI Calculator App!
vi: Chào mừng bạn đến với ứng dụng tính chỉ số BMI!

# height
source: Height (cm)
vi: Chiều cao (cm)

source: Weight
vi: Cân nặng

source: Age
vi: Tuổi

source: Gender
vi: Giới tính

source: Male
vi: Nam

source: Female
vi: Nữ

source: Calculate Now
vi: TÍNH NGAY

source: Profile
vi: Hồ sơ cá nhân

source: Information
vi: Thông tin

source: Help
vi: Trợ giúp

source: Logout
vi: Đăng xuất

# trendChart
source: BMI Trend Chart
vi: Biểu đồ Xu hướng BMI

# noHistoryData
source: No history data available
vi: Không có dữ liệu lịch sử

source: Unknown
vi: Không xác định

source: Result
vi: Kết quả

# bmiResultTitle
source: Your BMI Result
vi: Kết quả chỉ số BMI của bạn

source: BMI Value
vi: Giá trị BMI

source: Category
vi: Phân loại

source: Advice
vi: Lời khuyên

source: Back
vi: Quay lại

source: Underweight
vi: Thiếu cân

source: Normal
vi: Bình thường

source: Overweight
vi: Thừa cân

source: Obese
vi: Béo phì

# eatHealthy
source: You should eat more nutritious food!
vi: Hãy bổ sung thêm thực phẩm dinh dưỡng.

# maintain
source: Keep up your healthy lifestyle!
vi: Tiếp tục duy trì lối sống lành mạnh.

# exerciseMore
source: Exercise more regularly!
vi: Hãy tập thể dục thường xuyên hơn.

# consultDoctor
source: Consider consulting a doctor!
vi: Nên tham khảo ý kiến bác sĩ.

# weightChange
source: Your current weight:
vi: Cân nặng hiện tại:

source: Save
vi: Lưu

source: Calculate BMI
vi: Tính chỉ số BMI

source: English
vi: Tiếng Anh

source: Vietnamese
vi: Tiếng Việt

# profileTitle
source: Profile
vi: Hồ sơ cá nhân

source: Name
vi: Họ và tên

source: Phone
vi: Số điện thoại

# aboutTitle
source: About the Application
vi: Giới thiệu ứng dụng

# appName
source: BMI Calculator App
vi: Ứng Dụng Tính Chỉ Số BMI

# aboutDescription
source: Keep your body in perfect shape with our friendly BMI Tracker! A smart and easy-to-use Body Mass Index (BMI) calculator designed for everyone — men, women, teens, and adults. Whether you're aiming to lose weight, gain muscle, or maintain balance, this app is your best health companion!
vi: Giữ Vóc Dáng Chuẩn với Máy Theo Dõi BMI của Chúng Tôi! Một công cụ tính và theo dõi Chỉ Số Khối Cơ Thể (BMI) thân thiện, phù hợp cho nam, nữ, trẻ em, thanh thiếu niên và người lớn. Dù bạn đang trên hành trình giảm cân, tăng cơ hay duy trì sức khỏe, ứng dụng này sẽ là người bạn đồng hành tuyệt vời!

# sectionFeaturesTitle
source: ✨ What's Inside?
vi: ✨ Có Gì Bên Trong?

# sectionFeaturesBody
source: Discover a powerful tool packed in a minimal yet stylish interface that helps you start a healthy lifestyle today. Easily calculate your BMI, track progress, and get personalized tips — all for free!
vi: Khám phá một công cụ mạnh mẽ được gói gọn trong giao diện tối giản nhưng đầy phong cách, giúp bạn bắt đầu lối sống lành mạnh ngay hôm nay. Tính BMI dễ dàng, theo dõi tiến trình và nhận được những gợi ý cá nhân hóa—tất cả miễn phí!

# sectionHighlightsTitle
source: 🌟 Key Features
vi: 🌟 Tính Năng Nổi Bật

# sectionHighlightsBody
source: • Offline Mode: No internet needed — use anytime, anywhere! • Accurate BMI: Based on age, gender, height, and weight. • BMI Classification: Instantly see which category you fall into. • Ideal Weight Suggestion: Based on your height. • Flexible Units: Switch between Metric (kg, cm) and Imperial (lbs, ft). • History Tracking: Log your BMI journey with detailed records. • Health Tips: Personalized advice for your fitness goals. • UI Mode: Light / Dark themes. • Multi-Language Support: English and Vietnamese. • Simple Design: Modern and intuitive interface. • Completely Free: No hidden costs!
vi: • Sử Dụng Ngoại Tuyến: Không cần internet? Vẫn dùng được mọi lúc, mọi nơi! • Tính BMI Chính Xác: Dựa trên tuổi, giới tính, chiều cao và cân nặng. • Phân Loại BMI: Xem ngay bạn thuộc nhóm nào với các phân loại chi tiết. • Gợi Ý Trọng Lượng Chuẩn: Dựa theo chiều cao. • Linh Hoạt Đơn Vị: Chuyển đổi giữa hệ Mỹ (lbs, ft) và Metric (kg, cm). • Theo Dõi Lịch Sử: Ghi lại hành trình BMI với nhật ký chi tiết. • Mẹo Sống Khỏe: Lời khuyên cá nhân hóa cho mục tiêu fitness. • Chế Độ Giao Diện: Sáng / Tối linh hoạt. • Hỗ Trợ Nhiều Ngôn Ngữ: Tiếng Việt và Tiếng Anh. • Thiết Kế Đơn Giản: Hiện đại, dễ dùng. • Hoàn Toàn Miễn Phí: Không chi phí ẩn!

# sectionCategoriesTitle
source: 📊 BMI Categories
vi: 📊 Các Danh Mục BMI

# sectionCategoriesBody
source: Range Classification < 16 Severely Underweight 16 - 17 Moderately Underweight 17 - 18.5 Mildly Underweight 18.5 - 25 Normal 25 - 30 Overweight 30 - 35 Obese Class I 35 - 40 Obese Class II > 40 Obese Class III
vi: Phạm Vi Phân Loại < 16 Gầy Nặng 16 - 17 Độ Mỏng Trung Bình 17 - 18.5 Độ Mỏng Nhẹ 18.5 - 25 Bình Thường 25 - 30 Thừa Cân 30 - 35 Béo Phì Độ I 35 - 40 Béo Phì Độ II > 40 Béo Phì Độ III

# sectionWhatIsBMITitle
source: 🤔 What is BMI?
vi: 🤔 Chỉ Số BMI Là Gì?

# sectionWhatIsBMIBody
source: Body Mass Index (BMI) is a reliable indicator to estimate body fat based on height and weight for both men and women. It is calculated as weight (kg) divided by height squared (m²). This app also uses age and gender to improve accuracy and give a clearer picture of your health.
vi: Chỉ Số Khối Cơ Thể (BMI) là một chỉ số đáng tin cậy để đo lượng mỡ trong cơ thể dựa trên chiều cao và cân nặng, áp dụng cho cả nam và nữ. BMI được tính bằng cách lấy cân nặng (kg) chia cho bình phương chiều cao (m), biểu thị bằng kg/m². Ứng dụng này sử dụng tuổi và giới tính để tăng độ chính xác, giúp bạn hiểu rõ hơn về tình trạng sức khỏe của mình.

# sectionGuideTitle
source: 🚀 Getting Started
vi: 🚀 Hướng Dẫn Bắt Đầu

# sectionGuideBody
source: Usage: • Enter Info: Fill in gender, age, weight, and height. • Calculate: Tap 'Calculate' to view your BMI and category. • Explore: Check your ideal weight, BMR, and health advice. • Track: View your history and trends for motivation. Requirements: • Flutter SDK 3.0.0 or later. • IDE: Android Studio, VS Code, or any Flutter-supported editor. • Dependencies: Install required packages via pubspec.yaml. Installation: • Clone repository: git clone https://github.com/LeQuangThang205/2025_LTTBDD_N05_LE_QUANG_THANG.git • Enter project folder: cd bmi_calculator_app • Install dependencies: flutter pub get • Run app: flutter run
vi: Cách Sử Dụng: • Nhập Thông Tin: Điền giới tính, tuổi, cân nặng và chiều cao bằng các thanh trượt hoặc số liệu. • Tính Toán: Nhấn nút 'Tính Toán' để xem BMI và phân loại của bạn. • Khám Phá: Kiểm tra trọng lượng lý tưởng, BMR và lời khuyên cá nhân. • Theo Dõi Tiến Trình: Xem lịch sử và xu hướng để giữ động lực! Điều Kiện Tiền Quyết: • Flutter SDK: Cần phiên bản 3.0.0 trở lên. • IDE: Android Studio, VS Code hoặc trình soạn thảo khác. • Phụ Thuộc: Cài đặt package trong pubspec.yaml. Cài Đặt: • Clone repository: git clone https://github.com/LeQuangThang205/2025_LTTBDD_N05_LE_QUANG_THANG.git • Vào thư mục dự án: cd bmi_calculator_app • Cài đặt phụ thuộc: flutter pub get • Chạy ứng dụng: flutter run

# sectionTechTitle
source: 🛠️ Technologies Used
vi: 🛠️ Công Nghệ Sử Dụng

# sectionTechBody
source: • Framework: Flutter (Dart) • Localization: intl • UI Libraries: fl_chart, custom animations • Storage: shared_preferences • Sharing: share_plus • Assets: Custom backgrounds and splash logos
vi: • Framework: Flutter (Dart) • Đa Ngôn Ngữ: intl • Thư Viện UI: fl_chart, animation tùy chỉnh • Lưu Trữ: shared_preferences • Chia Sẻ: share_plus • Tài Nguyên: Hình ảnh nền, logo splash screen

# sectionCustomizeTitle
source: 🎨 Customization
vi: 🎨 Tùy Chỉnh

# sectionCustomizeBody
source: • Change background: assets/images/home.jpg (1080x1920px) • Splash logo: assets/images/splash_logo.png (1024x1024px) • Edit theme colors: in main.dart ThemeData
vi: • Thay đổi hình nền tại assets/images/home.jpg (1080x1920px) • Logo splash: assets/images/splash_logo.png (1024x1024px) • Chỉnh màu sắc trong ThemeData của main.dart

# sectionJourneyTitle
source: 🌱 Your Health Journey
vi: 🌱 Hành Trình Sức Khỏe Của Bạn

# sectionJourneyBody
source: Start today with BMI Calculator App! Track your BMI, receive useful tips, and share your progress with friends. If you have suggestions, submit an issue or pull request on GitHub. Developed with ❤️ by LÊ QUANG THẮNG.
vi: Hãy bắt đầu ngay hôm nay với BMI Calculator App! Theo dõi chỉ số BMI, nhận lời khuyên hữu ích, và chia sẻ tiến trình với bạn bè. Nếu bạn có góp ý, hãy gửi issue hoặc pull request trên GitHub. Được phát triển với ❤️ bởi LÊ QUANG THẮNG.
